# Tech Workers in Tech Companies

In [1]:
import pandas as pd
import numpy as np
import sqlite3
import seaborn as sns
import matplotlib as mpl
import matplotlib.pyplot as plt
import warnings
import datetime
import matplotlib.dates as mdates

from scipy import stats
from matplotlib.dates import DateFormatter
from IPython.display import display

# Load and Display Raw Data

In [2]:
db_survey = sqlite3.connect(
    "C:\\Users\\Space\\Documents\\py\\Projects\\TuringCollege\\TechMentalHealth\\DataSet\\mental_health.sqlite"
)

In [3]:
%matplotlib inline
pd.options.display.max_rows = 300000
pd.options.display.max_columns = 999
pd.options.display.max_colwidth = 500

# Answers

In [4]:
df_answers = pd.read_sql_query("SELECT * FROM Answer", db_survey)
df_answers.head()

  AnswerText  SurveyID  UserID  QuestionID
0         37      2014       1           1
1         44      2014       2           1
2         32      2014       3           1
3         31      2014       4           1
4         31      2014       5           1

# Tech Workers in Tech Companies

In [5]:
df_Answer9 = pd.read_sql_query(
    "SELECT UserID FROM Answer where QuestionID = 9 AND AnswerText = '1'",
    db_survey
)

In [6]:
df_Answer13 = pd.read_sql_query(
    "SELECT UserID FROM Answer where QuestionID = 13 AND AnswerText = '1'",
    db_survey
)

In [7]:
df_inner = pd.merge(df_Answer9, df_Answer13, on='UserID', how='inner')
df_inner.count()

UserID    909
dtype: int64

# Tech Workers in Tech Companies with Current Mental Disorders

In [8]:
df_Answer9 = pd.read_sql_query(
    "SELECT UserID FROM Answer where QuestionID = 9 AND AnswerText = '1'",
    db_survey
)

In [9]:
df_Answer13 = pd.read_sql_query(
    "SELECT UserID FROM Answer where QuestionID = 13 AND AnswerText = '1'",
    db_survey
)

In [10]:
df_Answer33 = pd.read_sql_query(
    "SELECT UserID FROM Answer where QuestionID = 33 AND AnswerText = 'Yes'",
    db_survey
)

In [11]:
df_inner = df_Answer9.merge(df_Answer13,on='UserID').merge(df_Answer33,on='UserID')
df_inner.count()

UserID    379
dtype: int64

# Tech Workers in Tech Companies with Past Mental Disorders

In [17]:
df_Answer9 = pd.read_sql_query(
    "SELECT UserID FROM Answer where QuestionID = 9 AND AnswerText = '1'",
    db_survey
)

In [18]:
df_Answer13 = pd.read_sql_query(
    "SELECT UserID FROM Answer where QuestionID = 13 AND AnswerText = '1'",
    db_survey
)

In [19]:
df_Answer34 = pd.read_sql_query(
    "SELECT UserID FROM Answer where QuestionID = 34 AND AnswerText = 'Yes'",
    db_survey
)

In [21]:
df_inner = df_Answer9.merge(df_Answer13,on='UserID').merge(df_Answer34,on='UserID')
df_inner.count()

UserID    371
dtype: int64

# Tech Workers in Tech Companies with Identified Mental Disorders

In [22]:
df_Answer9 = pd.read_sql_query(
    "SELECT UserID FROM Answer where QuestionID = 9 AND AnswerText = '1'",
    db_survey
)

In [23]:
df_Answer13 = pd.read_sql_query(
    "SELECT UserID FROM Answer where QuestionID = 13 AND AnswerText = '1'",
    db_survey
)

In [24]:
df_Answer78 = pd.read_sql_query(
    "SELECT UserID FROM Answer where QuestionID = 78 AND AnswerText = 'Yes'",
    db_survey
)

In [25]:
df_inner = df_Answer9.merge(df_Answer13,on='UserID').merge(df_Answer78,on='UserID')
df_inner.count()

UserID    0
dtype: int64

# Tech Workers in Tech Companies who Work Remotely

In [78]:
df_Answer9 = pd.read_sql_query(
    "SELECT DISTINCT AnswerText FROM Answer where QuestionID = 9",
    db_survey
)
df_Answer9

  AnswerText
0          1
1          0
2         -1

In [79]:
df_Answer13 = pd.read_sql_query(
    "SELECT DISTINCT AnswerText FROM Answer where QuestionID = 13",
    db_survey
)
df_Answer9

  AnswerText
0          1
1          0
2         -1

In [83]:
df_Answer118 = pd.read_sql_query(
    "SELECT DISTINCT AnswerText FROM Answer where QuestionID = 118",
    db_survey
)
df_Answer118

  AnswerText
0  Sometimes
1      Never
2     Always

In [75]:
df_inner = df_Answer9.merge(df_Answer13,on='UserID').merge(df_Answer118,on='UserID')
df_inner.count()

UserID    0
dtype: int64